Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: You are free instead to write your own accessor method, if at some future point you need to do something more complex than return the value.
ja: 将来、値を返すより複雑なことをしたいなら、貴方自身のアクセサメソッドを書いて結構です。

source: You can abuse this to count how often a type check occurs:
ja: 型チェックがどれくらい生じるか数えるために、これを酷使することができます：

source: You can achieve that by calling the regex as <.otherrule>.
ja: あなたは<.otherrule>として正規表現を呼ぶことによって、それを達成することができます。

source: You can also look behind to assert that the string only matches after another regex fragment.
ja: 文字列が別の正規表現の断片の後にだけマッチすると主張するために、後ろを見ることもできます。

source: You can also write the regex as m/hou?se/ without any spaces, and the ? will still quantify only the u.
ja: 何の空白もないm/hou?se/のように正規表現を書くこともできます。そして?はまだuだけを数量化するでしょう。

source: You can ask if two objects have the same numeric value with the == infix operator.
ja: 2つのオブジェクトが同じ数値を持つかどうか、==接中辞演算子で尋ねることができます。

source: You can call methods on that instance, as long as they do not try to access any state; new is an example, as it creates a new object rather than modifying or accessing an existing object.
ja: それらが何の状態にもアクセスしようとしない限り、あなたはそのインスタンスでメソッドを呼ぶことができます；newがその例です。存在するオブジェクトを変更するよりも新しいオブジェクトを作成します。

source: You can cause built-ins to automatically throw exceptions on failure using
ja: 次を使ってビルトインを失敗時に例外を自動的にスローさせる。

source: You can compose a role into a class at compile time or add it to an individual object at runtime.
ja: あなたはロールをコンパイル時にクラスに合成するか、実行時に個々のオブジェクトにそれを追加できます。

source: You can declare a parameter read/write by including the "is rw" trait.
ja: is rwトレイトを付け加えることでパラメータのread/writeを宣言することができる。

source: You can declare regexes just like subroutines--and even name them.
ja: あなたは正規表現をまるでサブルーチンのように宣言することができます ― そして、それらに名前さえつけられます。

source: You can do that with ordinary slicing access, or you can use signature binding:
ja: あなたは普通のスライスアクセスでそうすることができる、または、あなたはシグネチャーバインディングを使うことができます：

source: You can explicitly break out of a when block (and its surrounding topicalizer block) early using the succeed verb.
ja: succeedを使ってwhenブロック（トピカライザーブロックを囲っている）を明示的に早く脱出できる。

source: You can explicitly leave a when block and go to the next statement following the when by using proceed.
ja: proceedを使うことでwhenブロックを明示的に抜け、whenに続く次の文に行くことができる。

source: You can express any assignment of the form $var = $var op EXPR as $var op= EXPR.
ja: あなたは$var op= EXPRとして$var = $var op EXPRのどんな割り当てでも表すことができます。

source: You can force an explicit boolean context by putting a ? in front of an expression.
ja: ?を式の前に置くことによって明示的なブール値コンテキストを強制できます。

source: You can inherit from and extend grammars, mix roles into them, and take advantage of polymorphism.
ja: あなたはグラマーを継承、拡張、ロールをミックスし、ポリモーフィズムのアドバンテージを得ることができます。

source: You can pass in arguments to the constructor as well:
ja: 同様に引数をコンストラクタに渡すことができます：

source: You can pass roles around just like any other object.
ja: あなたは他のオブジェクトのようにロールを渡すことができます。

source: You can pass them around and store them in data structures just as you can do with any other piece of data.
ja: それらを他のデータ断片と同じく渡したりデータ構造に格納することができます。

source: You can query a hash table for the value that corresponds to a certain $key with %hash{$key} (footnote: Unlike Perl 5, in Perl 6 the sigil does not change when accessing an array or hash with [ ] or { }.
ja: あなたは$keyと一致する特定の値を%hash{$key}でハッシュテーブルに問い合わせることができます。（Perl 5と違い、Perl 6では[ ]または{ }で配列またはハッシュにアクセスする時にシギルを変えません。

source: You can test for value equivalence using the === infix operator.
ja: 同値の値かテストする===接中辞演算子を使うことができます。

source: You can turn any call to a subrule into a zero width assertion.
ja: あなたは、どのようなルール呼び出しでもゼロ幅アサーションにすることができます。

source: You can use any of these forms in any context where you can use a Pair object.
ja: Pairオブジェクトを使うことができる場所ならどんな文脈でもこれらの形式を使うことができます。

source: You can use this method to find out if a given object is a type object or not:
ja: あなたは、所定のオブジェクトが型オブジェクトであるかどうかこと知るために、このメソッドを使用することができます：

source: You can write the equivalent of many built-in anchors with look-ahead and look-behind assertions, though they won't be as efficient.
ja: 先読みと後読みアサーションで多くのビルトインアンカーの同等物を書くことができますが、それらは効率的ではないでしょう。

source: You could also write the example line as:
ja: あなたは例の行を次のように書くこともできます：

source: You could easily write it yourself:
ja: あなたは自分で簡単に書くことができます：

source: You could recursively traverse this object and create data structures based on what you find or execute code.
ja: あなたは再帰的にこのオブジェクトを横断することができ、何を探すか、またはコードを実行するかに基づいてデータ構造を作成できます。

source: You could think of other ways for Perl 6 to interpret this program.
ja: あなたは、Perl 6がこのプログラムを解釈する他の方法について考えることができます。

source: You don't have to understand everything in this example yet.
ja: あなたは、まだこの例ですべてを理解する必要はありません。

source: You don't have to use an explicit default--you can just fall off the last when into ordinary code.
ja: 明示的なdefaultを使う必要はない―普通のコードの最後のwhenをただ離れることもできる。

source: You have a word list and want to find words containing pe, then an arbitrary letter, and then an l (but not a space, as your puzzle has extra markers for those).
ja: あなたはワードリストを持っており、そしてワードがpe、それから任意の文字、そしてl（しかし空白ではなく、パズルはそれらの追加のマーカーを持っています）を含んでいるワードを探したいと思っています。

source: You have seen blocks before: both the for loop -> $line { ... } and the if statement worked on blocks.
ja: あなたは前にブロックを見ています：forループ-> $line { ... } とif文の両方はブロックで機能します。

source: You have two options to write multi subs: either you start every candidate with multi sub ... or multi ..., or you declare once and for all that the compiler shall view every sub of a given name as a multi candidate.
ja: あなたはマルチサブを書くために2つの選択肢を持っています：あなたはすべての候補をmulti sub ...またはmulti ...で始める、またはコンパイラが名前のすべてのサブをマルチ候補として見ると宣言します。

source: You inherit a default constructor named new from the base class Object, but you are free to override new, as this example does:
ja: あなたはnewという名前のデフォルトコンストラクターをベースクラス Objectから継承します。しかし例のようにnewをオーバーライドするのは自由です：

source: You may add characters to or subtract characters from classes with the + and - operators:
ja: +と-演算子でクラスに文字を加えるか、それを引きます：

source: You may also apply a role to an individual object.
ja: あなたはロールを個々のオブジェクトにも適用できます。

source: You may also export a subroutine to make it available to another scope.
ja: あなたはサブルーチンを他のスコープでも利用できるようにエクスポートすることもできます。

source: You may also perform an existence test, either on a single item or a junction of items:
ja: 単独のアイテムかジャンクションで存在のテストを実行できます：

source: You may also specify that a parameter may only ever be passed an argument by name (meaning that it is not allowed to pass it by position).
ja: パラメータがいつも名前による引数であることを示すこともできます（それを位置によって渡すことが許可されないことを意味します）。

source: You may choose to capture some arguments into positional parameters and leave the rest to be captured by a slurpy array parameter.
ja: あなたはいくつかの引数を位置依存のパラメータでキャプチャーし、残りをslurpyな配列パラメータに任せることができます。

source: You may force immediate conversion to a Capture object by prefixing the parcel composer with a backslash:
ja: バックスラッシュをパーセルコンポーザーの前に置くことによってCaptureオブジェクトへの即時の変換を強制できます：

source: You may have one CATCH block and one CONTROL block, since some user-defined constructs may wish to supply an implicit CONTROL block to your closure, but let you define your own CATCH block.
ja: 一つのCATCHブロックと一つのCONTROLブロックを持つこともできる。なのでいくつかのユーザー定義の構造が暗黙のCONTROLブロックをあなたのクロージャに与えたいと思うかもしれないが、あなたに独自のCATCHブロックを定義させる。

source: You may not go into a given or a for, though, because that would bypass a formal parameter binding (not to mention list generation in the case of for).
ja: あたなはgivenまたはforには行かないだろうけれど、それは仮パラメータのバインディングをバイパスするだろう（forのケースのリスト生成の言及ではない）。

source: You may not use whitespace between a term and its postfix or postcircumfix operators.
ja: 項とその接尾辞または後置接周辞演算子の間で空白文字を使うことはできません。

source: You may specify the unit with an argument of Degrees, Gradians or Circles.
ja: 単位を引数Degrees、GradiansまたはCirclesで指定できます。

source: You may suppress this by modifying the first declaration with proto:
ja: 最初の宣言をprotoを付けて変更すればこれを抑制できるだろう：

source: You may use :!exists to test for non-existence.
ja: :!existsで存在しないことをテストできます。

source: You might know this as reduce from other programming languages.
ja: あなたはこれを他のプログラミング言語のreduceとして知っているかもしれません。

source: You must use last (or some more violent control exception such as return) to break out of the entire loop early.
ja: 全体のループを早期に抜けるためにlast（またはreturnのようないくつかのより乱暴な制御例外）を使わなければならない。

source: You need a script that sums up how many matches and sets each player has won to determine the overall winner.
ja: あなたは全体の勝者を決定するために、各々のプレーヤーがどれだけの試合とセットで勝ちを得たか合計するスクリプトを必要とします。

source: You need a wormhole for that.
ja: あなたはそれのためにワームホールを必要とする。

source: You've already seen these in previous chapters.
ja: あなたは、前の章でこれらを既に見ました。

source: Your grammar describes the structure of the AST: its root element is the TOP node, which contains children of the allowed types and so on.
ja: あなたのグラマーはASTの構造を記述します：そのルート要素はTOPノードです。それは許可された型などの子を含みます。

source: [Conjecture: a bare next($retval) function could be taught to do the same, as long as $retval isn't a loop label.
ja: [推測：裸のnext($retval)関数は同じ事をするように教えられるかもしれない。$retvalがループラベルでない限り。

source: [Conjecture: all unhandled exceptions within a routine could be stored in @!, with the most recent first.
ja: ［推測：ルーチン内の全てのハンドルされない例外は最も最近のものが@!に格納される。

source: [Conjecture: there should either be an callergather primitive that does this, or it should be added to the job description of lift.
ja: ［推測：これをするcallergatherプリミティブか、liftの役割にそれを追加するべきだ。

source: absolute value
ja: 絶対値

source: add 1 to the result of the do block.
ja: はdoブロックの結果に1を加算する。

source: addition
ja: 加算

source: additive infix operators
ja: 加算の接中辞演算子

source: and that is equivalent to:
ja: そしてそれは以下と同じだ：

source: as a quasi-quoting symbol.
ja: quasi-quotingシンボルとして。

source: autoincrement and autodecrement
ja: オートインクリメントとオートデクリメント

source: boolean prefix
ja: ブールの接頭辞

source: calls the foo function with three arguments.
ja: はfoo関数を三つの引数で呼ぶ。

source: can now be written as:
ja: これは次のように書くことができます：

source: causes $x to start with its current value.
ja: は$xをその現在の値で始める。

source: chaining binary operators
ja: チェーンするバイナリ演算子

source: clarify "same structure"
ja: 「同じ構造」を明確にしてください。

source: concatenation: 'a' ~ 'b' is 'ab'
ja: 連結：'a' ~ 'b'は'ab'

source: conditional operator
ja: 代入演算子

source: conversion to number
ja: 数値への変換

source: conversion to string: ~1 becomes '1'
ja: 文字列への変換：~1は'1'になる

source: convert first character to lower case
ja: 最初の文字だけ小文字にする

source: convert first character to upper case
ja: 最初の文字だけ大文字にする

source: convert the first character of each word to upper case, and all other characters to lower case
ja: それぞれの単語の最初の文字だけ大文字にし、他のすべての文字を小文字にする

source: deletes the entries en passant while returning them.
ja: はそれらを返すついでにエントリーを削除します。

source: description
ja: 概要

source: digit
ja: 数字

source: division
ja: 除算

source: en
ja: ja

source: end of a line
ja: 行の終わり

source: end of string
ja: 文字列の終わり

source: exponentiation operator
ja: 指数演算子

source: exponentiation: $a**$b is $a to the power of $b
ja: 累乗：$a**$bは$aへの$bの累乗です

source: extract a part of the string.
ja: 文字列の一部を取り出す

source: horizontal whitespace
ja: 水平空白

source: if we're gonna blow past
ja: もし我々が過去を吹きとばそうとしているなら

source: in Perl 6 you should use a for instead:
ja: Perl 6では代わりにforを使うべきだ：

source: instead.
ja: と代わりに書く必要がある。

source: integer division
ja: 整数部

source: is actually short for:
ja: は実際は以下の略だ：

source: is equivalent to the Cish idiom:
ja: はC言語風のイディオムと同等だ：

source: is exactly equivalent to
ja: は以下とまさに同等だ。

source: is parsed as:
ja: は以下のようにパースされる：

source: is really just short for:
ja: は実際は以下の略だ：

source: it was always exit from your lexically scoped LINE loop, even if some inner dynamic scope you can't see happens to also have that label.
ja: それは常にレキシカルスコープなLINEループから抜け出す。あなたが見ることができないいくつかのダイナミックスコープがたまたまそのラベルを持っていても。

source: item assignment
ja: アイテム割り当て

source: left word boundary
ja: 左の語境界

source: list infix
ja: リスト接中辞

source: list prefix, list assignment
ja: リスト接頭辞、リスト割り当て

source: logarithm to base 10
ja: 10が底の対数

source: loose unary prefix
ja: ルーズな単項接頭辞

source: lower case
ja: 小文字にする

source: marks only the last exception as handled.
ja: は最後の例外だけハンドルされたとマークする。

source: method
ja: メソッド

source: method calls and postcircumfixes
ja: メソッド呼び出しと後置接周辞

source: modulo (remainder after division)
ja: 剰余（除算後の余り）

source: multiplication
ja: 乗算

source: multiplicative infix operators
ja: 乗法の接中辞演算子

source: named unary prefix
ja: 名前付きの単項接頭辞

source: natural logarithm
ja: 自然対数

source: negation
ja: 符号反転

source: newline
ja: 改行

source: non-chaining binary operators
ja: チェーンしないバイナリ演算子

source: number of characters in the string
ja: 文字列の文字数

source: or
ja: または

source: or append a question mark to the parameter's name:
ja: またはクエスチョンマークを引数名に追加します：

source: or equivalently, using placeholders:
ja: または同じようにプレースホルダーを使う：

source: or equivalently:
ja: または同様に：

source: prefix context operators
ja: 接頭コンテキスト演算子

source: prints out only the result of 5 - 7.
ja: は5 - 7の結果だけ出力します。

source: remove trailing newline
ja: 末尾の改行を削除する

source: replication operators
ja: 複製演算子

source: replication: 'a' x 2 is 'aa'
ja: 複製：'a' x 2は'aa'

source: right word boundary
ja: 右の語境界

source: right-hand or left-hand?
ja: 右側か左側か？

source: rounding down to an integer
ja: 整数へ切り捨てる

source: rounding to next integer
ja: 次の整数へ丸める

source: rounding up to an integer
ja: 整数へ丸める

source: se/ matches either house or hose.
ja: se/はhouseまたはhoseにマッチします。

source: sets the variable to 0 at END time, since that is when the "my" declaration is actually executed.
ja: はEND時に変数を0にセットする。「my」宣言が実際に実行される時まで。

source: so you can modify the current list element in that case.
ja: なのでその場合あなたは現在のリストの要素を変更できる。

source: square root
ja: 平方根

source: start of a line
ja: 行の開始

source: start of line
ja: 行の開始

source: start of string
ja: 文字列の開始

source: string concatenation
ja: 文字列の結合

source: style="fill: $c" />] } # both calls work the same paint-rectangle :color<Blue>; paint-rectangle :colour<Blue>; # of course you can still fill the other options paint-rectangle :width(30), :height(10), :colour<Blue>;
ja: style="fill: $c" />] } # both calls work the same paint-rectangle :color<Blue>; paint-rectangle :colour<Blue>; # もちろん、あなたはまだ他のオプションを満たすことができます paint-rectangle :width(30), :height(10), :colour<Blue>;

source: subtraction
ja: 減算

source: tabulator
ja: タブ文字

source: term
ja: 項

source: the result is a Parcel object containing three Int objects and a Pair object, that is, four positional objects.
ja: の結果は3つのIntオブジェクトとPairオブジェクトを含むParcel、すなわち4つの位置依存オブジェクトです。

source: the syntactic Parcel is translated (at compile time, in this case) into a Capture object with three positionals and one named argument in preparation for binding.
ja: 構文法のParcelはバインディングに備えて3つの位置依存と名前付き引数のCaptureオブジェクトに変換（この場合はコンパイル時に） されます。

source: then in a different program or module you can write
ja: そして異なるプログラムまたはモジュールで次のように書けます。

source: to automatically assign to $_ is not carried over to Perl 6.
ja: を自動的に$_へ割り当てることはPerl 6へは持ち越されない。

source: to get the Perl 5 behavior.
ja: Perl 5の振る舞いを得るために。

source: upper case
ja: 大文字にする

source: vertical whitespace
ja: 垂直空白

source: where each call to the block would bind a new invocant for the .waste method, each of which is likely different from the original invocant to the .haste method.)
ja: それぞれのブロックへの呼び出しが.wasteメソッドへの新しいインボカントをバインドするようなら、それぞれは.hasteメソッドのオリジナルのインボカントとおそらく違う。）

source: which is short for
ja: それは以下の略だ

source: whitespace
ja: 空白

source: will no longer see the value of the outer $x; you'll need to say either
ja: はもやは外側の$xの値を見ない；あなたは

source: word character
ja: ワード文字

source: you're really calling into a catch lambda that works something like this:
ja: 実際にはこれの何かのように動作するcatch lambdaの中へ呼んでいる：

source: Control flow is a dynamic feature of all computer programming languages, but languages differ in the extent to which control flow is attached to declarative features of the language, which are often known as "static" or "lexical".
ja: 制御フローは全てのコンピュータープログラミング言語における動的な機能だが、 制御フローに付属する「スタティック」や「レキシカル」として知られる宣言的機能の範囲は言語で異なる。
